tap "homebrew/bundle"
brew "bat"
brew "difftastic"
brew "eza"
brew "fnm"
brew "fzf"
brew "lazygit"
brew "neovim"
brew "powerlevel10k"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zoxide"
brew "zsh-syntax-highlighting"
cask "git-credential-manager"
