tap "homebrew/bundle"
tap "homebrew/services"
brew "difftastic"
brew "fnm"
brew "volta"
brew "fzf"
brew "lazygit"
brew "neovim"
brew "node"
brew "powerlevel10k"
brew "redis", restart_service: true
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "git-credential-manager"
cask "notion"
cask "zoom"
